package lect4.Task22;

/*
    Задание 22: Я никогда не буду работать за копейки

    Используя цикл вывести на экран сто раз надпись:
    «Я никогда не буду работать за копейки. Амиго»
*/

public class Task22Lect4 {

    public static void main(String[] args) {

        for (int i = 0; i < 100; i++)
        {
            System.out.printf("%s Я никогда не буду работать за копейки. Амиго\n", i+1);
        }
    }

}
