package lect1;

/*

    Задача №5

    Задание: вывести на экран текст:

    Меня зовут Амиго.

    Я согласен на зарплату $10/месяц в первый год.
    Я согласен на зарплату $20/месяц во второй год.
    Я согласен на зарплату $30/месяц в третий год.
    Я согласен на зарплату $40/месяц в четвертый год.
    Я согласен на зарплату $50/месяц в пятый год.

    Спасибо за щедрость, друг Риша!

*/

public class Task5 {

    public static void main(String[] args)

    {

        System.out.println("Меня зовут Амиго.\n");

        System.out.println("Я согласен на зарплату $10/месяц в первый год.");

        System.out.println("Я согласен на зарплату $20/месяц во второй год.");

        System.out.println("Я согласен на зарплату $30/месяц в третий год.");

        System.out.println("Я согласен на зарплату $40/месяц в четвертый год.");

        System.out.println("Я согласен на зарплату $50/месяц в пятый год.\n");

        System.out.println("Спасибо за щедрость, друг Риша!");

    }
}
