package lect3;

/*

    Задача №10 Изучаем японский

    Задание:
    Выведи на экран 日本語

*/

public class Task10Lect3 {

    public static void main(String[] args) {

        System.out.println("日本語");

    }

}
