package lect3;

/*

    Задача №2 4 скобки

    Задание:
    Расставить правильно (по другому) скобки, чтобы на экран вывелось число 850

*/

public class Task2Lect3 {

    public static void main(String[] args)

    {

        System.out.println( 1 + 2 * (3 + 4 * 5 + 6 * 7 + 8 * 9 + 10 * 11 + 12 * 13 + 14) + 15);

    }

}
