// encoding utf-8
package lect4.Task13;

/*
    Задание 13: 10 чисел наоборот

    Вывести на экран числа от 10 до 1, используя цикл while.
*/

public class Task13Lect4 {

    public static void main(String[] args) throws Exception {

        int n = 10;
        while (n>0){
            System.out.print(n + " ");
            n--;
        }
    }
}
