package lect2;

/*

    Задача №3

    Задание:
    Напиши программу, которая выводит на экран надпись: «Мне так плохо! Хочу, чтобы все умерли!».

*/

public class Task3Lect2 {

    public static void main(String[] args)

    {

        System.out.println ("Мне так плохо! Хочу, чтобы все умерли!");

    }

}
